package com.xren.calculatorgame.data

// класс созданный специально для уровней
data class Level(
    val id: Int,
    val start: Int,
    val target: Int,
    val moves: Int,
    val ops: List<String>
) {
    var table = Array(4) { Array(3) { "" } }

    init{
        table[0][0] = "OPT" // имя кнопки для настроек
        table[3][0] = "C" // имя кнопки для перезапуска уровня

        for(op in ops){
            // цикл для операций +, -, *, /, % (эти операции распределяются случайно по клавиатуре)
            while(true){
                val x = (0..2).random()
                val y = (0..3).random()
                if(table[y][x] == ""){
                    table[y][x] = op
                    break
                }
            }
        }
    }
}

// массив объектов класса Level (новый уровень создаётся в одну строчку кода)
val levels = arrayOf(
    Level(1, 0, 2, 2, listOf("+1")),
    Level(2, 1, 4, 2, listOf("+1", "*2")),
    Level(3, 1, 4, 2, listOf("+1", "*3")),
    Level(4, 1, 20, 3, listOf("+1", "*4")),
    Level(5, 5, 15, 3, listOf("-1", "*4")),

    Level(6, 30, 15, 4, listOf("-9", "*5")),
    Level(7, 6, 24, 2, listOf("+2", "+4", "*3")),
    Level(8, 2, 17, 2, listOf("-1", "+16", "*3")),
    Level(9, 13, 21, 2, listOf("*2", "-6", "*3")),
    Level(10, 69, 68, 4, listOf("-19", "*2", "-42", "+6")), //*

    Level(11, 16, 0, 3, listOf("-4", "/2")),
    Level(12, 16, 3, 3, listOf("/4", "+2")),
    Level(13, 55, 7, 3, listOf("/5", "+3", "/2")),
    Level(14, 54, 81, 3, listOf("*3", "+9", "/3")),
    Level(15, 63, 33, 4, listOf("*4", "/9", "+19", "-14", "-2")), //* (возможность в 3 хода)

    Level(0, -25, 5, 3, listOf("*-5", "/5", "-20")), //изи и база
    Level(0, 21, 42, 3, listOf("-29", "-34", "*-1")), // норм
    Level(0, 6, 64, 4, listOf("/6", "+16", "+31", "+19")), // изи
    Level(0, 21, 26, 4, listOf("-29", "*-1", "-34")), // средне
    Level(0, 4, -48, 4, listOf("*-3", "-37", "+38", "*-4")), // среднесложно

    Level(1, 13, 4, 4, listOf("+19", "+25", "/19", "+21", "-8")), // есть изи путь, но там есть ещё какой-то я забыл
    Level(1, -9, 40, 5, listOf("-18", "+45", "/9", "-10", "*-4")), // средне
    Level(1, 3, 20, 6, listOf("/3", "-22", "+46", "/-1", "/-5", "+15")), // среднесложно
    Level(1, -15, -74, 5, listOf("-37", "+44", "*12", "+8", "+14")), // сложновато
    Level(1, 3, -52, 5, listOf("-18", "*4", "/3", "+18", "-50")), // 4 хода; ещё как-то можно было (не так сложновато)

    Level(16, 777, 0,3,listOf("<<")),
    Level(17, 30, 15, 2, listOf("-9", "*5", "<<")),
    Level(18, 34, 4, 3,listOf("<<", "*2", "-1")),
    Level(19, 9, 16, 3, listOf("<<", "*12", "+11", "*8")), //*
    Level(20, 92, 48, 5, listOf("*8", "-6", "<<", "*-1")), //*

    Level(2, 18, 39,5,listOf("<<", "+2", "/-1", "/-2", "+38")), // есть изи путь, наводит меня на мысль, что можно сделать задание, где надо потратить больше ходов
    Level(2, 56, 78, 4, listOf("*7", "/3", "*6", "/6", "<<")), // забавнич
    Level(2, -10, 1,4,listOf("-14", "+30", "+6", "<<")), // изи
    Level(2, 56, 77, 4, listOf("*7", "/3", "*6", "/6", "<<")), // забавнич 2
    Level(2, 0, -50, 5, listOf("*18", "-20", "<<", "*-1", "+49", "*-10")), // либо хард, либо невозможно (я забыл)

    Level(3, -1, 1,1,listOf("|", "+1")), // база
    Level(3, -2, 5,3,listOf("|", "-2", "-1")), // база
    Level(3, -2, 3,3,listOf("|", "-2", "-1")), // база
    Level(3, -21, 117,4,listOf("|", "+24", "*3")), // база
    Level(3, -17, -16,3,listOf("/17", "|", "-17")), // база

    Level(4, -19, 77,6,listOf("|", "+8", "*19", "/9", "+23", "-3")),
    Level(4, 56, 78, 4, listOf("*7", "/3", "*6", "/6", "<<")),
    Level(4, 0, -50, 5, listOf("*18", "-20", "<<", "*-1", "+49", "*-10")),

    )
